Documents/ВключениеВКадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВключениеВКадровыйРезерв</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаВключениеВКадровыйРезерв</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьСтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.СтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.ИсторияКадровогоРезерва</xr:Item>
				<xr:Item>InformationRegister.УдалитьИсторияКадровогоРезерва</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВключенияВКадровыйРезерв</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
					<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчастникКадровогоРезерва</Name>
							<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСКадровымиРезервистами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусГотовности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыГотовностиРезервистов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куратор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КадровыйРезерв</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеВключенияВРезерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИсключенияИзРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДействияСКадровымиРезервистами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияСКадровымиРезервистами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оставить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВключениеВКадровыйРезерв/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗакрытьПослеЗаписи;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементов();
	УстановитьУсловноеОформление();
	
	// Начальное заполнение
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		Объект.ДатаРассмотрения = Объект.Дата;
		
		Если ЗначениеЗаполнено(Параметры.Подразделение) Тогда
			Объект.Подразделение = Параметры.Подразделение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ВидРезерва) Тогда
			Объект.ВидРезерва = Параметры.ВидРезерва;
		КонецЕсли;
		
		Если Параметры.Свойство("ОснованиеОбъект") Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Конкурсы") Тогда
				МодульКонкурсы = ОбщегоНазначения.ОбщийМодуль("Конкурсы");
				МодульКонкурсы.ЗаполнитьОснованиеКонкурсом(ЭтотОбъект, Параметры.ОснованиеОбъект);
			КонецЕсли;
			Объект.ОснованиеОбъект = Параметры.ОснованиеОбъект;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.УчастникКадровогоРезерва) Тогда
			ЗаполнитьПоУчастникуКадровогоРезерва(Параметры);
		ИначеЕсли ЗначениеЗаполнено(Параметры.ПозицияРезерва) Тогда
			ДополнитьТЧСотрудникиСтрокойПоПараметрам(Параметры);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьОписанияДействия();
	ЗаполнитьДанныеУчастниковКадровогоРезерва();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ВключениеВРезервПриСозданииНаСервере(ЭтотОбъект, Параметры);
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		МодульГосударственнаяСлужбаФормы = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужбаФормы");
		МодульГосударственнаяСлужбаФормы.УстановитьПараметрыВыбораСотрудников(ЭтотОбъект,
			"СотрудникиУчастникКадровогоРезерва");
		МодульГосударственнаяСлужбаФормы.УстановитьВидимостьОснования(ЭтотОбъект, "СотрудникиОснование");
	КонецЕсли; 
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	ПодразделениеПрежнее = Объект.Подразделение;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗакрытьПослеЗаписи = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьОписанияДействия();
	ЗаполнитьДанныеУчастниковКадровогоРезерва();
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЖдатьЗакрытияФормыУведомления = Ложь;
	
	Если Объект.Проведен Тогда
		ПроверитьНаличиеРезерва();
	КонецЕсли;
	
	Оповестить("ЗаписаноВключениеВКадровыйРезерв");
	Оповестить("Запись_ВключениеВКадровыйРезерв", ПараметрыЗаписи, Объект.Ссылка);
	
	Если ЗакрытьПослеЗаписи И Не ЖдатьЗакрытияФормыУведомления Тогда
		Закрыть();
	ИначеЕсли ЗакрытьПослеЗаписи Тогда
		ЖдатьЗакрытияФормыУведомления = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если ЖдатьЗакрытияФормыУведомления Тогда
		ЖдатьЗакрытияФормыУведомления = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФорматированнаяНадписьСотрудникиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Образование" Тогда
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено
			Или ТипЗнч(ТекущиеДанные.УчастникКадровогоРезерва) <> Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ФизическоеЛицоСсылка", ТекущиеДанные.УчастникКадровогоРезерва);
		ПараметрыОткрытия.Вставить("НеРегистрироватьОткрытиеФормы", Истина);
		ОткрытьФорму("ОбщаяФорма.ФизическиеЛицаОбразованиеКвалификация", ПараметрыОткрытия, ЭтотОбъект, Истина, , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)

	НужноОчиститьТабличнуюЧасть = Ложь;
	Для Каждого СтрокаСотрудники Из Объект.Сотрудники Цикл
		Если ЗначениеЗаполнено(СтрокаСотрудники.УчастникКадровогоРезерва) Тогда
			НужноОчиститьТабличнуюЧасть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НужноОчиститьТабличнуюЧасть Тогда
		КадровыйРезервКлиент.ПодразделениеПриИзменении(ЭтотОбъект, "Сотрудники");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Утвердить");
		КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(Элемент.ТекущиеДанные, Ложь);
	КонецЕсли;
	УстановитьДоступностьКоманд(ЭтотОбъект, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ФорматированнаяНадписьСотрудники = "";
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьКоманд(ЭтотОбъект, ТекущиеДанные);
	УстановитьФорматированнуюНадписьСотрудники(ТекущиеДанные.УчастникКадровогоРезерва);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СотрудникиОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУчастникКадровогоРезерваПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьДанныеУчастниковКадровогоРезерва(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ТекущиеДанные.УчастникКадровогоРезерва));
	УстановитьФорматированнуюНадписьСотрудники(ТекущиеДанные.УчастникКадровогоРезерва);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУчастникКадровогоРезерваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УчастникКадровогоРезерва = Элементы.Сотрудники.ТекущиеДанные.УчастникКадровогоРезерва;
	
	Если ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		СтандартнаяОбработка = Ложь;
		ПодобратьРезервистов(Элемент, Ложь);
	ИначеЕсли ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		СтандартнаяОбработка = Ложь;
		МодульПодборПерсоналаКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодборПерсоналаКлиент");
		Отбор = Новый Структура;
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			Отбор.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		МодульПодборПерсоналаКлиент.ПодобратьКандидатов(Элемент, Отбор, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУчастникКадровогоРезерваОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СотрудникиУчастникКадровогоРезерваОбработкаВыбораНаСервере(ВыбранноеЗначение, Элементы.Сотрудники.ТекущаяСтрока);
	УстановитьФорматированнуюНадписьСотрудники(ТекущиеДанные.УчастникКадровогоРезерва);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУчастникКадровогоРезерваОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.УчастникКадровогоРезерва) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		НайденныеСтроки = ДанныеУчастниковКадровогоРезерва.НайтиСтроки(Новый Структура("УчастникКадровогоРезерва",
			ТекущиеДанные.УчастникКадровогоРезерва));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Кандидат = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НайденныеСтроки[0].СтруктураДанных, "Кандидат");
			Если ЗначениеЗаполнено(Кандидат) Тогда
				СтандартнаяОбработка = Ложь;
				ПоказатьЗначение(, Кандидат);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиНаставникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		
		МодульНаставничествоКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НаставничествоКлиент");
		МодульНаставничествоКлиент.ВыбратьНаставника(ЭтаФорма, Элемент, Объект.ДатаРассмотрения);
		
	Иначе
		
		КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(Элемент, , ,
			Объект.ДатаРассмотрения,Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиНаставникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработкаВыполнена = Ложь;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		
		МодульНаставничествоКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НаставничествоКлиент");
		МодульНаставничествоКлиент.НаставникОбработкаВыбора(ОбработкаВыполнена);
		
	КонецЕсли;
	
	Если Не ОбработкаВыполнена Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
			ТекущиеДанные.Наставник = ФизическоеЛицоСотрудника(ВыбранноеЗначение);
		Иначе
			ТекущиеДанные.Наставник = ВыбранноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиКураторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(Элемент,,,Объект.ДатаРассмотрения,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиКураторОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТекущиеДанные.Куратор = ФизическоеЛицоСотрудника(ВыбранноеЗначение);
	Иначе
		ТекущиеДанные.Куратор = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ЗакрытьПослеЗаписи = Истина;
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКандидатами(Команда)
	
	ЗаполнитьКандидатамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Включить(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Утвердить");
	ТекущиеДанные.ДатаОкончания = КонецМесяца(ДобавитьМесяц(Объект.ДатаРассмотрения, 60))-1;
	
	УстановитьДоступностьКоманд(ЭтотОбъект, ТекущиеДанные);
	КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(ТекущиеДанные, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Отклонить");
	ТекущиеДанные.ДатаОкончания = '00010101';
	
	УстановитьДоступностьКоманд(ЭтотОбъект, ТекущиеДанные);
	КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(ТекущиеДанные, Ложь);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПодобратьРезервистов(Элементы.Сотрудники, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодобратьКандидатов(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсоналаКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодборПерсоналаКлиент");
		Отбор = Новый Структура;
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			Отбор.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		МодульПодборПерсоналаКлиент.ПодобратьКандидатов(Элементы.Сотрудники, Отбор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИПР(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УчастникКадровогоРезерва = ТекущиеДанные.УчастникКадровогоРезерва;
	Если Не ЗначениеЗаполнено(УчастникКадровогоРезерва)
		Или ТипЗнч(УчастникКадровогоРезерва) <> Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура());
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Владелец", УчастникКадровогоРезерва);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Основание", ТекущиеДанные.ПозицияРезерва);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Наставник", ТекущиеДанные.Наставник);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Куратор", ТекущиеДанные.Куратор);
	
	ОткрытьФорму("Справочник.ИндивидуальныйПланРазвития.ФормаОбъекта",
		ПараметрыФормы, ЭтотОбъект, УчастникКадровогоРезерва);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент,
			СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора,
			СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	ТипыУчастниковКадровогоРезерва = КадровыйРезерв.ТипыУчастниковКадровогоРезерваДоступныхПоФункциональнымОпциям();
	НесколькоТиповУчастников = ТипыУчастниковКадровогоРезерва.Количество() > 1;
	Если НесколькоТиповУчастников Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиПодбор", "Видимость",
			Ложь);
		КадровыйРезервФормы.ДополнитьКомандыИКнопкиПодбора(ЭтотОбъект, "СотрудникиКоманднаяПанель", "Сотрудники");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУчастникуКадровогоРезерва(Параметры)

	// Сначала заполним из пула кандидатов, если таковые имеются.
	ЗаполнитьКандидатамиНаСервере(Параметры.УчастникКадровогоРезерва);
	
	// Затем добавим строку на основании переданных параметров.
	ДополнитьТЧСотрудникиСтрокойПоПараметрам(Параметры);

	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Данные = КадровыйРезерв.ДанныеУчастникаКадровогоРезерва(Параметры.УчастникКадровогоРезерва);
		Если ЗначениеЗаполнено(Данные) Тогда
			Объект.Подразделение = Данные.МестоВСтруктуреПредприятия;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДополнитьТЧСотрудникиСтрокойПоПараметрам(СтруктураПараметры)
	
	СтруктураПоиска = Новый Структура;
	Если СтруктураПараметры.Свойство("УчастникКадровогоРезерва") Тогда
		СтруктураПоиска.Вставить("УчастникКадровогоРезерва", СтруктураПараметры.УчастникКадровогоРезерва);
	КонецЕсли;
	Если СтруктураПараметры.Свойство("ПозицияРезерва") Тогда
		СтруктураПоиска.Вставить("ПозицияРезерва", СтруктураПараметры.ПозицияРезерва);
	КонецЕсли;
	
	НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяПозиция = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПозиция, СтруктураПараметры);
		НоваяПозиция.ДатаОкончания = КонецМесяца(ДобавитьМесяц(Объект.ДатаРассмотрения, 60))-1;
		НоваяПозиция.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Утвердить");
		КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(НоваяПозиция, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва, Неопределено - 
&НаСервере
Процедура ЗаполнитьКандидатамиНаСервере(УчастникКадровогоРезерва = Неопределено)

	ИспользоватьКадровыйРезервПоВидам = ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйРезервПоВидам");
	Если ИспользоватьКадровыйРезервПоВидам И Не ЗначениеЗаполнено(Объект.ВидРезерва) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнятьПоРезервисту = УчастникКадровогоРезерва <> Неопределено;
	
	Объект.Сотрудники.Очистить();
	
	Отбор = КадровыйРезерв.НовыйОтборКадровогоРезерваНаДату();
	Если ЗаполнятьПоРезервисту Тогда
		Отбор.УчастникиКадровогоРезерва = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УчастникКадровогоРезерва);
	КонецЕсли;
	Если ИспользоватьКадровыйРезервПоВидам И ЗначениеЗаполнено(Объект.ВидРезерва) Тогда
		Отбор.ВидРезерва = Объект.ВидРезерва;
	КонецЕсли;
	Отбор.Статусы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Рассматривается"));
	Отбор.ИсключаемыйРегистратор = Объект.Ссылка;
	
	ТаблицаРезервистов = КадровыйРезерв.КадровыйРезервНаДату(Объект.ДатаРассмотрения, Отбор);
	Для каждого Резервист Из ТаблицаРезервистов Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Резервист);
		НоваяСтрока.ДатаОкончания = КонецМесяца(ДобавитьМесяц(Объект.ДатаРассмотрения, 60))-1;
		НоваяСтрока.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Утвердить");
		КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(НоваяСтрока, Ложь);
	КонецЦикла; 
	
	Если Не ЗаполнятьПоРезервисту Тогда
		ЗаполнитьДанныеУчастниковКадровогоРезерва();
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКоманд(Форма, ТекущиеДанные)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиВключить",
		"Доступность",
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Отклонить"));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиОтклонить",
		"Доступность",
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Утвердить"));
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписанияДействия()
	
	Для каждого СтрокаСотрудник Из Объект.Сотрудники Цикл
		КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(СтрокаСотрудник, Ложь);
	КонецЦикла; 
	
КонецПроцедуры

// Параметры:
//  УчастникиКадровогоРезерва - Неопределено,Массив из ОпределяемыйТип.УчастникКадровогоРезерва
&НаСервере
Процедура ЗаполнитьДанныеУчастниковКадровогоРезерва(УчастникиКадровогоРезерва = Неопределено)

	Если УчастникиКадровогоРезерва = Неопределено Тогда
		УчастникиКадровогоРезерва = ОбщегоНазначения.ВыгрузитьКолонку(Объект.Сотрудники, "УчастникКадровогоРезерва",
			Истина);
		ДанныеУчастниковКадровогоРезерва.Очистить();
	Иначе
		Для Каждого УчастникКадровогоРезерва Из УчастникиКадровогоРезерва Цикл
			УдалитьДанныеУчастникаКадровогоРезерва(УчастникКадровогоРезерва);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеСотрудников = ДанныеСотрудников(УчастникиКадровогоРезерва);
	ДобавитьДанныеУчастниковКадровогоРезерва(ДанныеСотрудников);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		ДанныеКандидатов = МодульПодборПерсонала.ДанныеКандидатовДляВключенияВКадровыйРезерв(УчастникиКадровогоРезерва);
		ДобавитьДанныеУчастниковКадровогоРезерва(ДанныеКандидатов);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
&НаСервере
Процедура ЗаполнитьДанныеУчастникаКадровогоРезерва(УчастникКадровогоРезерва)
	
	УчастникиКадровогоРезерва = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УчастникКадровогоРезерва);
	ЗаполнитьДанныеУчастниковКадровогоРезерва(УчастникиКадровогоРезерва);
	
КонецПроцедуры

// Параметры:
//  УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
&НаСервере
Процедура УдалитьДанныеУчастникаКадровогоРезерва(УчастникКадровогоРезерва)
	
	Отбор = Новый Структура("УчастникКадровогоРезерва", УчастникКадровогоРезерва);
	УдаляемыеСтроки = ДанныеУчастниковКадровогоРезерва.НайтиСтроки(Отбор);
	Для каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		ДанныеУчастниковКадровогоРезерва.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ДанныеСотрудников - см. НоваяТаблицаДанныхУчастниковКадровогоРезерва
&НаСервере
Процедура ДобавитьДанныеУчастниковКадровогоРезерва(ДанныеСотрудников)
	
	Для Каждого ТекущаяСтрока Из ДанныеСотрудников Цикл
		НоваяСтрока = ДанныеУчастниковКадровогоРезерва.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДанныеСотрудников(Знач СписокФизическихЛиц)

	// Готовим ВТ фильтров
	ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизическихЛиц, Истина, Неопределено,
		ТекущаяДатаСеанса());
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСотрудников.Сотрудник,
	|	ТаблицаСотрудников.ФизическоеЛицо,
	|	&ДатаСреза КАК Период
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	&ТаблицаСотрудников КАК ТаблицаСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
	|	ФизическиеЛица.ДатаРождения,
	|	&ДатаСреза КАК Период
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Ссылка В(&СписокФизическихЛиц)";
	
	Запрос.УстановитьПараметр("ТаблицаСотрудников", ТаблицаСотрудников);
	Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	Запрос.Выполнить();
	
	// Запрос по местам работы сотрудника.
	ПараметрыПолученияРабочихМест = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников();
	ПараметрыПолученияРабочихМест.НачалоПериода		= '00010101';
	ПараметрыПолученияРабочихМест.ОкончаниеПериода  = ТекущаяДатаСеанса();
	ПараметрыПолученияРабочихМест.СписокСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	КадровыйУчет.СоздатьВТРабочиеМестаСотрудников(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияРабочихМест);
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(Описатель, Ложь, "ДатаПриема");
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТРабочиеМестаСотрудников.Сотрудник КАК Сотрудник,
		|	ВТРабочиеМестаСотрудников.Должность КАК Должность,
		|	ВТРабочиеМестаСотрудников.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ВТРабочиеМестаСотрудников.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.НачальныеДанные)
		|			ТОГДА ВТКадровыеДанныеСотрудников.ДатаПриема
		|		ИНАЧЕ ВТРабочиеМестаСотрудников.ПериодЗаписи
		|	КОНЕЦ КАК ПериодЗаписи
		|ИЗ
		|	ВТРабочиеМестаСотрудников КАК ВТРабочиеМестаСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
		|		ПО ВТРабочиеМестаСотрудников.Сотрудник = ВТКадровыеДанныеСотрудников.Сотрудник
		|ГДЕ
		|	ВТРабочиеМестаСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.НеподтвержденныеДанные)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодЗаписи УБЫВ
		|ИТОГИ ПО
		|	Сотрудник";
	РабочиеМестаСотрудников = Новый Соответствие;
	ВыборкаСотрудники = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСотрудники.Следующий() Цикл
		МассивРабочихМест = Новый Массив;
		ВыборкаДетальныеЗаписи = ВыборкаСотрудники.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() И МассивРабочихМест.Количество() < 3 Цикл
			МассивРабочихМест.Добавить(Новый Структура("Должность, Подразделение, ПериодЗаписи",
				ВыборкаДетальныеЗаписи.Должность, ВыборкаДетальныеЗаписи.Подразделение,
				ВыборкаДетальныеЗаписи.ПериодЗаписи));
		КонецЦикла;
		РабочиеМестаСотрудников.Вставить(ВыборкаСотрудники.Сотрудник, МассивРабочихМест);
	КонецЦикла;
	
	// Получаем данные физических лиц.
	Описание = КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц("ВТФизическиеЛица");
	КадровыеДанные = "ПолученныеОбразования,ЗнанияЯзыков,Профессии,Специальности,ТрудоваяДеятельность";
	
	ИтоговыйЗапрос = КадровыйУчет.ЗапросВТПостоянныеКадровыеДанныеФизическихЛиц(Истина, Описание, КадровыеДанные, ,
		"ВТПостоянныеКДФизическихЛиц"); 
	ИтоговыйЗапрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ИтоговыйЗапрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТФизическиеЛица.ФизическоеЛицо КАК УчастникКадровогоРезерва,
	|	ВТФизическиеЛица.ДатаРождения,
	|	ВТСотрудники.Сотрудник,
	|	ЕСТЬNULL(ВТПостоянныеКДФизическихЛиц.ПолученныеОбразования, """") КАК ПолученныеОбразования,
	|	ЕСТЬNULL(ВТПостоянныеКДФизическихЛиц.ЗнанияЯзыков, """") КАК ЗнанияЯзыков,
	|	ЕСТЬNULL(ВТПостоянныеКДФизическихЛиц.Профессии, """") КАК Профессии,
	|	ЕСТЬNULL(ВТПостоянныеКДФизическихЛиц.Специальности, """") КАК Специальности,
	|	ЕСТЬNULL(ВТПостоянныеКДФизическихЛиц.ТрудоваяДеятельность, """") КАК ТрудоваяДеятельность
	|ИЗ
	|	ВТФизическиеЛица КАК ВТФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ВТСотрудники
	|		ПО ВТФизическиеЛица.ФизическоеЛицо = ВТСотрудники.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПостоянныеКДФизическихЛиц КАК ВТПостоянныеКДФизическихЛиц
	|		ПО ВТФизическиеЛица.ФизическоеЛицо = ВТПостоянныеКДФизическихЛиц.ФизическоеЛицо";
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	ДанныеСотрудников = КадровыйРезервФормы.НоваяТаблицаДанныхУчастниковКадровогоРезерва();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ОписаниеДанных = КадровыйРезервФормы.НовоеОписаниеУчастникаКадровогоРезерва();
		
		Если ЗначениеЗаполнено(ВыборкаЗапроса.ДатаРождения) Тогда
			ДанныеСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.СведенияОСтаже();
			ДанныеСтажа.ДатаОтсчета = ВыборкаЗапроса.ДатаРождения;
			Возраст = ЗарплатаКадрыРасширенныйКлиентСервер.ПродолжительностьСтажа(ДанныеСтажа, ТекущаяДатаСеанса());
			ПредставлениеСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.ПредставлениеСтажа(Возраст.Лет, 0, 0);
			ТекстВозраста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 (%2)",
				Формат(ВыборкаЗапроса.ДатаРождения, "ДЛФ=D"), ПредставлениеСтажа);
		Иначе
			ТекстВозраста = НСтр("ru ='<не заполнена>'");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОписаниеДанных, ВыборкаЗапроса);
		
		ОписаниеДанных.МассивРабочихМест = РабочиеМестаСотрудников.Получить(ВыборкаЗапроса.Сотрудник);
		ОписаниеДанных.ТекстВозраста = ТекстВозраста;
		
		НоваяСтрока = ДанныеСотрудников.Добавить();
		НоваяСтрока.УчастникКадровогоРезерва = ВыборкаЗапроса.УчастникКадровогоРезерва;
		НоваяСтрока.СтруктураДанных = ОписаниеДанных;
		
	КонецЦикла;
	
	Возврат ДанныеСотрудников;
	
КонецФункции

// Возвращает адрес во временном хранилище массива уже подобранных сотрудников.
//
&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	// Найдем сотрудников по физлицам
	СписокСотрудниковПоФизическимЛицам = ТаблицаСотрудниковИФизлиц(
		Объект.Сотрудники.Выгрузить(,"УчастникКадровогоРезерва").ВыгрузитьКолонку("УчастникКадровогоРезерва"));
	
	Возврат ПоместитьВоВременноеХранилище(СписокСотрудниковПоФизическимЛицам.ВыгрузитьКолонку("Сотрудник"),
		УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаСотрудниковИФизлиц(СписокФизическихЛиц)
	
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыСотрудников.СписокФизическихЛиц = СписокФизическихЛиц;
	
	Возврат КадровыйУчет.СотрудникиОрганизации(Истина,ПараметрыСотрудников);
	
КонецФункции

// См. КадровыйРезервФормы.ОтборИзПодразделения
&НаСервереБезКонтекста
Функция ОтборИзПодразделения(Знач Подразделение)

	Возврат КадровыйРезервФормы.ОтборИзПодразделения(Подразделение);

КонецФункции

&НаКлиенте
Процедура УстановитьФорматированнуюНадписьСотрудники(УчастникКадровогоРезерва)

	ДанныеУчастникаКадровогоРезерва = СтрокаДанныхУчастникаКадровогоРезерва(ЭтотОбъект, УчастникКадровогоРезерва);
	Если ДанныеУчастникаКадровогоРезерва = Неопределено Тогда
		ФорматированнаяНадписьСотрудники = "";
		Возврат;
	КонецЕсли;
	
	// Заполняем форматированную строку результатами.
	ФорматированнаяНадписьСотрудники = "";
	МассивСтрок = Новый Массив;
	
	ЖирныйШрифт = Новый Шрифт(,,Истина);
	
	// Возраст
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Дата рождения'") + " - ", ЖирныйШрифт));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ДанныеУчастникаКадровогоРезерва.ТекстВозраста));
	МассивСтрок.Добавить(Символы.ПС);
	
	// Образование
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Образование:'") + " ", ЖирныйШрифт));
	Если ЗначениеЗаполнено(ДанныеУчастникаКадровогоРезерва.ПолученныеОбразования) Тогда
		Для СчСтрок = 1 По СтрЧислоСтрок(ДанныеУчастникаКадровогоРезерва.ПолученныеОбразования) Цикл
			СтрокаОбразования = СтрПолучитьСтроку(ДанныеУчастникаКадровогоРезерва.ПолученныеОбразования, СчСтрок);
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаОбразования,,,,"Образование"));
			Суффикс = ?(СтрЧислоСтрок(ДанныеУчастникаКадровогоРезерва.ПолученныеОбразования) = СчСтрок, "", ", ");
			МассивСтрок.Добавить(Суффикс);
		КонецЦикла;
	Иначе
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '<не заполнено>'")));
	КонецЕсли;
	МассивСтрок.Добавить(Символы.ПС);
	
	// Работа
	МассивТекстовРаботы = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеУчастникаКадровогоРезерва.МассивРабочихМест) Тогда
		Для каждого РабочееМесто Из ДанныеУчастникаКадровогоРезерва.МассивРабочихМест Цикл
			ТекстРаботы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 в %2 с %3'"),
			РабочееМесто.Должность,
			РабочееМесто.Подразделение,
			Формат(РабочееМесто.ПериодЗаписи, "ДЛФ=D"));
			Суффикс = ?(ДанныеУчастникаКадровогоРезерва.МассивРабочихМест.Найти(РабочееМесто) + 1 = ДанныеУчастникаКадровогоРезерва.МассивРабочихМест.Количество(),
				"", ", ");
			МассивТекстовРаботы.Добавить(Новый ФорматированнаяСтрока(ТекстРаботы, Суффикс));
		КонецЦикла; 
	КонецЕсли;

	Если МассивТекстовРаботы.Количество() > 0 Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Работа в компании:'") + " ", ЖирныйШрифт));
		МассивСтрок.Добавить(МассивТекстовРаботы);
	Иначе
		Если ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
			Текст = НСтр("ru = 'Кандидат'");
		Иначе
			Текст = НСтр("ru = 'Внешний сотрудник'");
		КонецЕсли;
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Текст, ЖирныйШрифт));
	КонецЕсли;
	МассивСтрок.Добавить(Символы.ПС);
		
	Если ЗначениеЗаполнено(ДанныеУчастникаКадровогоРезерва.ТрудоваяДеятельность) Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Предыдущие места работы:'") + " ",
			ДанныеУчастникаКадровогоРезерва.ТрудоваяДеятельность));
		МассивСтрок.Добавить(Символы.ПС);
	КонецЕсли;
	
	// Профессии, специальность, языки
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ДанныеУчастникаКадровогоРезерва.Профессии));
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ДанныеУчастникаКадровогоРезерва.Специальности));
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ДанныеУчастникаКадровогоРезерва.ЗнанияЯзыков));
	МассивСтрок.Добавить(Символы.ПС);
	
	ФорматированнаяНадписьСотрудники = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаДанныхУчастникаКадровогоРезерва(Форма, УчастникКадровогоРезерва)

	НайденноеСоответствие = Форма.ДанныеУчастниковКадровогоРезерва.НайтиСтроки(
		Новый Структура("УчастникКадровогоРезерва", УчастникКадровогоРезерва));
	Если НайденноеСоответствие.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат НайденноеСоответствие[0].СтруктураДанных;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура УстановитьРезервистаИзПодбора(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт

	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		ТекущиеДанные.УчастникКадровогоРезерва = РезультатЗакрытия;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор,
		"Объект.Сотрудники.Действие",
		Перечисления.ДействияСКадровымиРезервистами.Отклонить,
		ВидСравненияКомпоновкиДанных.Равно);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СотрудникиДатаОкончания");
		
	Элемент = УсловноеОформление.Элементы.Добавить();
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор,
		Неопределено, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора,
		"Объект.Сотрудники.Действие",
		Перечисления.ДействияСКадровымиРезервистами.Утвердить,
		ВидСравненияКомпоновкиДанных.Равно);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора,
		"Объект.Сотрудники.СтатусГотовности",,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СотрудникиСтатусРезервиста");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеРезерва()
	
	Если Не ВыводитьУведомлениеПослеЗаписи() Тогда
		Возврат;
	КонецЕсли;
	
	АктуальныйРезерв = НаличиеРезерва();
	Если АктуальныйРезерв.Количество() > 0 Тогда
		КадровыйРезервКлиент.ВывестиУведомлениеОНаличииРезерва(АктуальныйРезерв, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаличиеРезерва()
	
	МассивРезервов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	КадровыйРезерв.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.ДатаВключения < &ТекущаяДата
		|	И (КадровыйРезерв.ДатаИсключения > &ТекущаяДата
		|			ИЛИ КадровыйРезерв.ДатаИсключения = ДАТАВРЕМЯ(1, 1, 1))
		|	И КадровыйРезерв.УчастникКадровогоРезерва В(&УчастникиКадровогоРезерва)
		|ИТОГИ ПО
		|	УчастникКадровогоРезерва";
		
	Запрос.УстановитьПараметр("УчастникиКадровогоРезерва",
		Объект.Сотрудники.Выгрузить().ВыгрузитьКолонку("УчастникКадровогоРезерва"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ВыборкаСтрок = Выборка.Выбрать();
		СтруктураРезерва = Новый Структура("УчастникКадровогоРезерва, ПозицииРезерва, ПозицииКандидатаВРезерв");
		СтруктураРезерва.УчастникКадровогоРезерва = Выборка.УчастникКадровогоРезерва;
		ПозицииРезерва = Новый Массив;
		ПозицииКандидатаВРезерв = Новый Массив;
		Пока ВыборкаСтрок.Следующий() Цикл
			Если ВыборкаСтрок.Статус = Перечисления.СостоянияСогласования.Согласовано Тогда
				СтрокиРезерва = Объект.Сотрудники.НайтиСтроки(
					Новый Структура("УчастникКадровогоРезерва, ПозицияРезерва", Выборка.УчастникКадровогоРезерва, 
						ВыборкаСтрок.ПозицияРезерва));
				Если СтрокиРезерва.Количество() = 0 Тогда
					ПозицииРезерва.Добавить(ВыборкаСтрок.ПозицияРезерва);
				КонецЕсли;
			Иначе
				ПозицииКандидатаВРезерв.Добавить(ВыборкаСтрок.ПозицияРезерва);
			КонецЕсли;
		КонецЦикла;
		Если ПозицииРезерва.Количество() > 0 Или ПозицииКандидатаВРезерв.Количество() > 0 Тогда
			СтруктураРезерва.ПозицииРезерва = ПозицииРезерва;
			СтруктураРезерва.ПозицииКандидатаВРезерв = ПозицииКандидатаВРезерв;
			МассивРезервов.Добавить(СтруктураРезерва);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивРезервов;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьПослеПроведения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Если Результат.БольшеНеЗадаватьЭтотВопрос Тогда
		СохранитьВыводитьУведомлениеПослеЗаписи(Ложь);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыводитьУведомлениеПослеЗаписи()
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		Метаданные.Документы.ВключениеВКадровыйРезерв.Формы.ФормаДокумента.ПолноеИмя(), "ВыводитьУведомлениеПослеЗаписи",
		Истина);
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьВыводитьУведомлениеПослеЗаписи(ВыводитьУведомление)

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		Метаданные.Документы.ВключениеВКадровыйРезерв.Формы.ФормаДокумента.ПолноеИмя(), "ВыводитьУведомлениеПослеЗаписи",
		ВыводитьУведомление);

КонецПроцедуры

&НаСервере
Функция ФизическоеЛицоСотрудника(Сотрудник)
	
	Возврат ЗарплатаКадрыРасширенныйПовтИсп.ФизическоеЛицоСотрудника(Сотрудник);
	
КонецФункции

&НаСервере
Процедура СотрудникиОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	ВыбранныеСотрудники = ОбщегоНазначения.СкопироватьРекурсивно(ВыбранноеЗначение);
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(ВыбранныеСотрудники,
		Тип("СправочникСсылка.Сотрудники"));
	ФизическиеЛица = КадровыйУчет.ФизическиеЛицаСотрудников(ВыбранныеСотрудники);
	ДобавитьУчастниковКадровогоРезерва(ФизическиеЛица);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		ЛичныеДанныеКандидатов = МодульПодборПерсонала.СсылкиНаЛичныеДанныеКандидатов(ВыбранноеЗначение);
		ДобавитьУчастниковКадровогоРезерва(ЛичныеДанныеКандидатов);
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.Сотрудники Цикл
		УстановитьДоступностьКоманд(ЭтотОбъект, ТекущаяСтрока);
	КонецЦикла;
	ЗаполнитьОписанияДействия();
	ЗаполнитьДанныеУчастниковКадровогоРезерва();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУчастниковКадровогоРезерва(УчастникиКадровогоРезерва)
	
	Для каждого УчастникКадровогоРезерва Из УчастникиКадровогоРезерва Цикл
		НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(Новый Структура("УчастникКадровогоРезерва",
			УчастникКадровогоРезерва));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.Сотрудники.Добавить();
		НоваяСтрока.УчастникКадровогоРезерва = УчастникКадровогоРезерва;
		НоваяСтрока.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Утвердить");
		НоваяСтрока.ДатаОкончания = КонецМесяца(ДобавитьМесяц(Объект.ДатаРассмотрения, 60)) - 1;
		НоваяСтрока.Основание = Справочники.ОснованияКадровогоРезерва.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиУчастникКадровогоРезерваОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущаяСтрока)
	
	ТекущиеДанные = Объект.Сотрудники.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТекущиеДанные.УчастникКадровогоРезерва = ФизическоеЛицоСотрудника(ВыбранноеЗначение);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Кандидаты") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		ТекущиеДанные.УчастникКадровогоРезерва = МодульПодборПерсонала.ЛичныеДанныеКандидатов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение)).Получить(ВыбранноеЗначение);
	Иначе
		ТекущиеДанные.УчастникКадровогоРезерва = ВыбранноеЗначение;
	КонецЕсли;
	
	ЗаполнитьДанныеУчастникаКадровогоРезерва(ТекущиеДанные.УчастникКадровогоРезерва);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьРезервистов(ВладелецФормыВыбора, МножественныйВыбор)
	
	ОтборИзПодразделения = ОтборИзПодразделения(Объект.Подразделение);
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтборИзПодразделения, "Организация");
	Подразделение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтборИзПодразделения, "Подразделение");
	
	ПараметрыОткрытия = Неопределено;
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		ПараметрыОткрытия = Новый Структура("ВключатьВедомственныхВоенных", Истина);
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ГосударственнаяСлужбаКлиент");
		Модуль.УточнитьПараметрыОткрытияФормыВыбораСотрудников(ПараметрыОткрытия);
	КонецЕсли; 
		
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		ВладелецФормыВыбора, Организация, Подразделение, Объект.ДатаРассмотрения, МножественныйВыбор,
		АдресСпискаПодобранныхСотрудников(), ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти
